In [ ]:
DB
* A big collection (GBs, TBs) of data
* Data is stored in a hierarchy
    DB1 -> Tables/Collections -> Data
    DB2 -> Tables/Collections -> Data

DBMS
* Software -> perform CRUD ops of DB
* Exposed this SW as a query language i.e SQL
    * O/p data -> Wrapper
    * Input data -> Wrapper
    * Update data -> Wrapper
    * Delete data -> Wrapper
* Each wrapper can be accessed/invoked using simple queries

In [ ]:
Types of DB:-
* Relational DBs - SQL, PostgreSQL, etc -> Data is stored as Tables
* Non-relational DBs NoSql - MongoDB, Cassandra (Graph DB by FB) -> Data is stored in free format

In [ ]:
Tables -> structured form 
R1 C1 C2 C3
R2 C1 C2 C3

Jsons -> unstructured form
[{
    "a": 5,
    "b": 7
},
{
    "a": "hello",
    "x": 25,
    1: 13.4
}]

In [ ]:
SQL:-
* Structured query language
* R1 C1 C2 C3 C4 C5
  R2 C1 C2 C3 C4 C5
  R3 C1 C2 C3 C4 C5
  R4 C1 C2 C3 C4 
  Each column is called an Attribute
  Each row is called a Tuple
  No. of rows is called Cardinality
  No. of cols is called Degree

In [ ]:
SQL Datatypes:-
* Int - int, bigint, numeric, Money (inc in order of size)
* Float - float, real (inc in order of size)
* Bool - binary (0/1)
* String - char, varchar, text
           char - fixed length # roll nos - alphannumeric, 10 digit 
           varchar, text - variable length # names
* Date and time - datetime, date, time
* Image - image # 255*255*255

varchar(255)
Rohit Sharma - 11 bytes
Ravidra Jadeja - 14 bytes
APJ Abdul Kalam - 50 bytes

A variable-length column only takes up the space it needs to store a string of characters, with no spaces added to pad out the column. For this reason, VARCHAR columns are great for storing strings that vary greatly in size.

In [ ]:
Query Categories:-
1. Data Definition Lang (DDL) - Creating, updating, removing tables
    Create, Alter, Drop, etc
2. Data Manipulation Lang (DML) - Update existing data and create new data (rows)
    Update, Insert, Delete, etc
3. Data Query Language (DQL) - Read ops
    Select
4. Transaction Query Lang (TQL) - To update/save the state of your DB
    rollback, commit, savepoint etc
    commit - Save the state of a DB at 12 am. (checkpoint - unique alpnum string)
    rollback - 4 am come back to 12 am state -> rollback to checkpoint
5. Data Control Language (DCL)
    Grant, Revoke -> User authorizations to query DBs
    U1 -> DB1 (R, no W), no DB2
    U2 -> DB2 (R and W), no DB1

In [ ]:
CREATE DATABASE school;
CREATE DATABASE college;
SHOW DATABASES;
SHOW TABLES;

In [ ]:
https://www.mycompiler.io/new/sql

Limit n -> first n rows
Limit n offset m -> [m+1, ..., end] | LIMIT N

If both OFFSET and LIMIT appear, then OFFSET rows are skipped before starting to count the LIMIT rows that are returned.

In [ ]:
Select o/p -> 10
Limit 5 -> R1, ..., R5
Limit 4 offset 5 -> R6, R7, R8, R9, R10 -> R6, R7, R8, R9

In [ ]:
Default value v/s self incrementing counter
* SIC
    DBMS SQL takes care of it
    rollno SIC and start = 100
    Insert into class10 values (<>, "rohit", ...)
* Default value
    Default value -> supress the rules presented by SQL "123"
    no use of this dv -> dirty data
    come back and clean
    
    When data comes in multiple sources -> we cant expect it to have all attributes
    cricket stats -> espn, starsports
    F1 -> extract data -> 9/10 -> C5 (dv) -> come back and update # dv = sql123sql
    F2 -> extract data -> 10/10

In [ ]:
-- SELECT * FROM class10;
-- SELECT name, rollno FROM class10;
-- >, <, >=, <=, !=
-- SELECT * FROM class10 where rollno == 3;
-- SELECT * FROM class10 where rollno BETWEEN 2 AND 4;
-- SELECT * FROM class10 where name == "virat";
-- SELECT * FROM class10 where UPPER(name) == UPPER("Virat");
-- SELECT * FROM class10 where UPPER(name) LIKE UPPER("%Harpreet%");
-- OR, NOT
-- SELECT * FROM class10 where section == "B" AND rollno < 6;
-- SELECT * FROM class10 where section == "B" OR rollno < 3;

-- SELECT DISTINCT section from class10;


-- SELECT * FROM class10 LIMIT 2 OFFSET 2;
-- SELECT * FROM class10 OFFSET 2; # 3 ,4 ,5 ,6 | LIMIT 5 -> 3, 4, 5, 6
-- SELECT * FROM class10 ROWNUM < 4; only in OracleDB
-- SELECT * FROM class10 where section == "B" OR rollno < 3 LIMIT 5;
-- LIMIT n -> n records -> OFFSET x -> removes first x records from n
-- SELECT * FROM class10 where section == "B" AND rollno < 6 LIMIT 5 OFFSET 1;
-- SELECT * FROM class10 LIMIT 4 OFFSET 2;
-- l3 o2 -> 3 , 4, 5
-- l4 o2 -> 3 , 4, 5, 6

-- SELECT * FROM class10 ORDER BY name;
-- SELECT * FROM class10 ORDER BY name DESC;
-- SELECT * FROM class10 ORDER BY gender, name DESC;

-- UPDATE class10 SET name = "VIRAT KOHLI" WHERE rollno == 12;
-- UPDATE class10 SET section = "A" WHERE section == "B";
-- DELETE FROM class10 WHERE UPPER(name) LIKE ("%harpreet%");

-- ALTER TABLE class10 DROP COLUMN gender;

-- DROP TABLE class10;


-- SELECT * from class10;

In [ ]:
Update v/s Upsert:-
* SQL doesnt support Upsert
* 2, "Virat", "M", "A"
    UPDATE class10 SET name = "VIRAT KOHLI" WHERE rollno == 2; 
    
    it means something is missing (upsert)
    update query/function upsert query/function
    upsert runs -> only when update fails

In [ ]:
Aggregation Functions:-
* Count - no. of records Count(*)
* Min, Max, Sum, Avg - on a column